app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
  def show
    @user = User.find_by id: params[:id]